app/controllers/dashboards_controller.rb

  def show
    # @overdue_todos = current_contact.company.projects.todos.overdue
    @services = current_contact.services.includes(:open_todos, :reports, :service_type)
    @projects = current_contact.projects.includes(:open_todos, :project_status)
    @show_welcome_section = current_contact.show_welcome_section
    @welcome_text = WelcomeSection.last.present? ? WelcomeSection.first.welcome_text.html_safe : ""
---
SELECT  "welcome_sections".* FROM "welcome_sections" ORDER BY "welcome_sections"."id" DESC LIMIT $1  [["LIMIT", 1]]