app/controllers/pages_controller.rb

  def home
    redirect_to dashboard_url(subdomain: Organization.first.subdomain)
---
SELECT  "public"."organizations".* FROM "public"."organizations" WHERE "public"."organizations"."subdomain" = $1 LIMIT $2  [["subdomain", "public"], ["LIMIT", 1]]